app/CentralLogics/helpers.php

    public static function schedule_order()
    {
        return (bool)BusinessSetting::where(['key' => 'schedule_order'])->first()->value;
---
select * from `business_settings` where (`key` = 'schedule_order') limit 1

    public static function get_business_settings($name)
    {
        $config = null;

        $paymentmethod = BusinessSetting::where('key', $name)->first();
---
select * from `business_settings` where `key` = 'fcm_credentials' limit 1

    public static function currency_code()
    {
        if (!request()->is('/api*') && !session()->has('currency_code')) {
            $currency = BusinessSetting::where(['key' => 'currency'])->first()->value;
---
select * from `business_settings` where (`key` = 'currency') limit 1

    public static function currency_symbol()
    {
        if (!session()->has('currency_symbol')) {
            $currency_symbol = Currency::where(['currency_code' => Helpers::currency_code()])->first()->currency_symbol;
---
select * from `currencies` where (`currency_code` = 'NGN') limit 1

    public static function format_currency($value)
    {
        if (!session()->has('currency_symbol_position')) {
            $currency_symbol_position = BusinessSetting::where(['key' => 'currency_symbol_position'])->first()->value;
---
select * from `business_settings` where (`key` = 'currency_symbol_position') limit 1