app/Http/Controllers/Api/V1/DeliverymanController.php

    public function accept_order(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'order_id' => 'required|exists:orders,id',
        ]);
        if ($validator->fails()) {
            return response()->json(['errors' => Helpers::error_processor($validator)], 403);
        }
        $dm = DeliveryMan::where(['auth_token' => $request['token']])->first();
        $order = Order::where('id', $request['order_id'])
            // ->whereIn('order_status', ['pending', 'confirmed'])
            ->whereNull('delivery_man_id')
            ->dmOrder()
            ->first();
        if (!$order) {
            return response()->json([
                'errors' => [
                    ['code' => 'order', 'message' => translate('messages.can_not_accept')]
                ]
            ], 404);
        }
        if ($dm->current_orders >= config('dm_maximum_orders')) {
            return response()->json([
                'errors' => [
                    ['code' => 'dm_maximum_order_exceed', 'message' => translate('messages.dm_maximum_order_exceed_warning')]
                ]
            ], 405);
        }
        if ($order->order_type == 'parcel' && $order->order_status == 'confirmed') {
---
select * from `orders` where `id` = 100005 and `delivery_man_id` is null and (`order_type` = 'parcel' or `order_type` = 'delivery') limit 1