app/Http/Controllers/Api/V1/StoreController.php

    public function get_stores(Request $request, $filter_data = "all")
    {
        if (!$request->hasHeader('zoneId')) {
            $errors = [];
            array_push($errors, ['code' => 'zoneId', 'message' => translate('messages.zone_id_required')]);
            return response()->json([
                'errors' => $errors
            ], 403);
        }

        $type = $request->query('type', 'all');
        $zone_id = $request->header('zoneId');
        $longitude = $request->header('longitude');
        $latitude = $request->header('latitude');
        $stores = StoreLogic::get_stores($zone_id, $filter_data, $type, $request['limit'], $request['offset'], $request->query('featured'), $longitude, $latitude);
        $stores['stores'] = Helpers::store_data_formatting($stores['stores'], true);
        if ($request->userId) {
            $user =  User::where('id', $request->userId)->first();
---
select * from `users` where `id` = '1' limit 1